{
    "index": {
      "heading": "Building Robust Backend Systems with Code",
      "description": "As a backend software engineer with 3+ years of experience, I specialize in creating scalable microservices, optimizing system performance, and integrating AI solutions. Currently pursuing a Master's in Artificial Intelligence while working with technologies like Go, Kotlin, Python, and modern backend frameworks.",
      "resume": "Download Resume",
      "contact": "Contact Me"
    },
    "meta": {
      "description": "Obed Rayo - Backend Software Engineer with 3+ years of experience in microservices, API development, and system optimization. Specializing in Go, Kotlin, Python, and AI integration."
    },
    "navbar": {
        "home": "Home",
        "about": "About",
        "projects": "Projects",
        "articles": "Articles"
    },
    "about": {
        "header": "Code Crafted with Precision and Performance!",
        "aboutMe": "About Obed Rayo",
        "paragraph1": "Hi, I'm Obed Rayo, a backend software engineer with over 3 years of professional experience specializing in microservices architecture, API development, and system optimization. I have a strong foundation in multiple programming languages including Go, Kotlin, Python, Java, TypeScript, and JavaScript.",
        "paragraph2": "My expertise lies in building scalable backend systems using frameworks like Django, Flask, Spring Boot, FastAPI, and Echo. I've successfully engineered microservices that reduced latency by 40%, implemented distributed systems across multiple regions, and integrated AI models to automate critical business processes with 98% efficiency improvements.",
        "paragraph3": "Currently pursuing a Master's degree in Artificial Intelligence, I combine traditional backend engineering with cutting-edge AI integration. I'm passionate about system design, performance optimization, and creating robust solutions that scale effectively while maintaining high reliability and security standards.",
        "numbersText1": "Development Hours",
        "numbersText2": "Projects Completed",
        "numbersText3": "Years of Experience"
    },
    "footer": {
        "text": "All Rights Reserved."
    },
    "skills": {
        "skills": "Technical Skills & Expertise"
    },
    "projects": {
        "header": "Engineering Solutions Through Code!",
        "progress": "In Progress...",
        "projects": {
          "backend": "Backend Development",
          "frontend": "Frontend Development",
          "cli": "Command Line Interface",
          "fullStack": "Full Stack Development",
          "vipTop10Title": "VipTop10 - Location Intelligence API",
          "vipTop10Summary": "Advanced RESTful API providing comprehensive location intelligence with category filtering, geographic data management, and intelligent recommendation systems for places, cities, and countries.",
          "mernFrontendTitle": "MERN Stack Frontend Application",
          "mernBackendTitle": "MERN Stack Backend API",
          "cliTitle": "Data Structures CLI - Stack & Queue Implementation",
          "cliSummary": "Professional command-line interface implementing LIFO (Stack) and FIFO (Queue) data structures with comprehensive operations, error handling, and performance optimization.",
          "webFrontendTitle": "Modern Web Frontend Application",
          "jovianCareersTitle": "Jovian Careers - Job Platform",
          "chatGptCloneTitle": "AI Chat Application - GPT Integration",
          "chatGptCloneSummary": "Sophisticated chat application leveraging OpenAI's GPT-3.5 model for intelligent text completions with real-time conversation management and user experience optimization.",
          "lowLevelType": "Low Level Programming",
          "lowLevelTitle": "Systems Programming & Low-Level Development",
          "higherLevelType": "High Level Programming",
          "higherLevelTitle": "High-Level Application Development",
          "higherLevelSummary": "Complex application development using high-level programming languages and frameworks, focusing on business logic, user interfaces, and system integration.",
          "BankCoreTitle": "BankCore - Enterprise Banking System",
          "BankCoreSummary": "Comprehensive banking backend system built with Python and Django, featuring robust security, transaction management, user authentication, and scalable architecture designed for enterprise-level financial applications."
        },
        "link": {
          "visitProject": "View Project",
          "visit": "Explore"
        }
    },
    "articles": {
        "work": "Technical articles and insights coming soon..."
    }
  }
  